import 'domain/sight.dart';

// final Sight jazzHotel = Sight(
//     'Jazz Hotel',
//     'https://jazzhotel.ru/',
//     '''«Джаз отель» расположен в южном округе города Москвы, недалеко от станций метро «Варшавская» и «Каширская», откуда до центра города можно добраться за 20 минут. На расстоянии в 2,8 километра от гостиницы располагается музей-заповедник «Коломенское», в 6 километрах - парк «Царицыно».''',
//     'отель',
//     55.66,
//     37.62);
// final Sight kristalHotel = Sight(
//     'Kristal Hotel',
//     'http://hkristal.ru/',
//     '''Трехзвездочный отель «Кристалл» предлагает размещение в современных комфортабельных номерах по привлекательным ценам в центре Москвы, с индивидуальным сервисом для каждого гостя.''',
//     'гостинница',
//     55.68,
//     37.57);
// final Sight metropolHotel = Sight(
//     'Metropol',
//     'https://metropol-moscow.ru/',
//     '''«Метрополь» был задуман меценатом, владельцем первой в России частной оперы Саввой Мамонтовым, как «театр с гостиницей». К созданию проекта Мамонтов привлекает архитектора Вильяма Валькотта, художников Михаила Врубеля, Николая Андреева и многих других.
// ''',
//     'отель',
//     55.75,
//     37.62);

// final List mocks = [jazzHotel, kristalHotel, metropolHotel];

final mocks = [
  Sight(
      'Jazz Hotel',
      'https://jazzhotel.ru/',
      '''«Джаз отель» расположен в южном округе города Москвы, недалеко от станций метро «Варшавская» и «Каширская», откуда до центра города можно добраться за 20 минут. На расстоянии в 2,8 километра от гостиницы располагается музей-заповедник «Коломенское», в 6 километрах - парк «Царицыно».''',
      'отель',
      55.66,
      37.62,
      '/ui/res/images.jazz.jpg'),
  Sight(
      'Kristal Hotel',
      'http://hkristal.ru/',
      '''Трехзвездочный отель «Кристалл» предлагает размещение в современных комфортабельных номерах по привлекательным ценам в центре Москвы, с индивидуальным сервисом для каждого гостя.''',
      'гостинница',
      55.68,
      37.57,
      '/lib/ui/res/images/kristal.jpg'),
  Sight(
      'Metropol',
      'https://metropol-moscow.ru/',
      '''«Метрополь» был задуман меценатом, владельцем первой в России частной оперы Саввой Мамонтовым, как «театр с гостиницей». К созданию проекта Мамонтов привлекает архитектора Вильяма Валькотта, художников Михаила Врубеля, Николая Андреева и многих других.
''',
      'отель',
      55.75,
      37.62,
      '/ui/res/images/metropol.jpg')
];
